In [20]:
from os.path import join,isfile,isdir
import pandas as pd
url = 'http://j.finfra.com/_file/emp.csv'
dPath='/tmp/emp.csv'  
if not isfile(dPath) :
  !pwd
  storage_options = {'User-Agent': 'Mozilla/5.0'}
  df = pd.read_csv(url)
  df.to_csv(dPath,index=False)
else:
  df = pd.read_csv(dPath)

/Users/nowage/GoogleDrive_finfra/Git/NumpyAndPandas/Pandas

In [24]:
df

         empno,ename,job,mgr,hiredate,sal,comm,deptno
0    7839,KING,PRESIDENT,NULL,1981-11-17,5000,NULL,10
1     7698,BLAKE,MANAGER,7839,1981-05-01,2850,NULL,30
2     7782,CLARK,MANAGER,7839,1981-05-09,2450,NULL,10
3     7566,JONES,MANAGER,7839,1981-04-01,2975,NULL,20
4   7654,MARTIN,SALESMAN,7698,1981-09-10,1250,1400,30
5     7499,ALLEN,SALESMAN,7698,1981-02-11,1600,300,30
6      7844,TURNER,SALESMAN,7698,1981-08-21,1500,0,30
7        7900,JAMES,CLERK,7698,1981-12-11,950,NULL,30
8      7521,WARD,SALESMAN,7698,1981-02-23,1250,500,30
9      7902,FORD,ANALYST,7566,1981-12-11,3000,NULL,20
10       7369,SMITH,CLERK,7902,1980-12-09,800,NULL,20
11    7788,SCOTT,ANALYST,7566,1982-12-22,3000,NULL,20
12      7876,ADAMS,CLERK,7788,1983-01-15,1100,NULL,20
13     7934,MILLER,CLERK,7782,1982-01-11,1300,NULL,10

In [33]:
import pandas as pd
url = 'http://j.finfra.com/_file/example.tsv'
dPath='/tmp/example.tsv'

if not isfile(dPath) :
  !pwd
  storage_options = {'User-Agent': 'Mozilla/5.0'}
  df = pd.read_table(url)
  df.to_csv(dPath,index=False,sep="\t")
else:
  df = pd.read_csv(dPath,sep="\t")

/Users/nowage/GoogleDrive_finfra/Git/NumpyAndPandas/Pandas

In [34]:
!rm {dPath}

In [35]:
df

   id         document  label
0  96         인생 영화 추천      1
1  99             망작이다      0
2  78   쓰래기 보는데 돈을 쓰다니      0
3  95         진짜 재미 없다      0
4  15            볼일 없다      0
5   5        마음이 편해진다.      1
6  43           돈이 아깝다      0
7  71             지루하다      0
8  78  차라리 남중구 강의를 듣겠다      0